package com.db.data.pojo.categories

object Categories {

    object Educations {
        const val EDUCATION = "Образование"
        const val LECTURE = "Лекции"
        const val READING = "Чтения"
        const val MASTER_CLASS = "Мастер-классы"
    }

    object Nature {
        const val LONGEVITY = "Долголетие"
        const val LANDSCAPES = "События в парках"
    }
    object Shows {
        const val CONCERTS = "Концерты"
        const val SPECTACLES = "Спектакли"
        const val FESTIVAL = "Городские фестивали"
        const val FAIRS = "Выставки"
        const val CINEMA = "Кино"
    }

    object Actions {
        const val QUEST = "Квесты"
        const val EXCURSIONS = "Экскурсии"
        const val SPORT = "Спортивные события"
        const val GAMES = "Игры"
    }
    const val HOLIDAYS = "Праздники"
    const val PROMOS = "Акции"
    const val MY_REGION = "Мой район"
    const val CHILD = "Для детей"
    const val EMPTY_EAT = "Категория еда и напитки"
    const val EMPTY_LOVE = "Категория для двоих"
    const val EMPTY_FRIENDS = "Для друзей"

    val IDS_EDUCATION= listOf(239299,283299,284299,15299)
    val IDS_NATURE= listOf(84299,70299)
    val IDS_SHOWS= listOf(78299,80299,81299,86299,187299)
    val IDS_ACTIONS= listOf(344299,85299,89299,83299)
    val IDS_HOLIDAYS= listOf(88299)
    val IDS_MY_REGION= listOf(231299)
    val IDS_CHILD= listOf(305299)
    val IDS_PROMO= listOf(87299)

    val WORDS_EDUCATION = listOf(
        "научиться", "учеба", "учитель", "умнее", "умный", "знания",
        "узнать", "выучить", "понять", "ум", "узнать", "книги",
        "прочитать", "чтение", "прочесть", "библиотеки", "наука", "научные",
        "исследовать", "изучить","обучать","обучение","интересно"
    )
    val WORDS_NATURE = listOf(
        "природа", "здоровье", "лес", "птицы",
        "воздух", "энергия", "кислород", "вода", "водоем", "свежий",
        "расслабиться", "пикник", "цвет", "растения", "польза",
        "прогулка", "парк", "отдохнть с семьей",
    )
    val WORDS_SHOWS = listOf(
        "концерт", "кино", "фестиваль", "пьеса", "музыка", "исполнители", "шоу",
        "постановка", "сцена", "билет", "балет", "художник", "картина",
        "искусство", "культура", "досуг", "театр", "выставка", "кинотеатр", "фильм", "комедии", "видео",
        "выступления", "семья","весело"
    )
    val WORDS_ACTIONS = listOf(
        "спорт", "соревнования", "прыгать", "йога", "гимнастика",
        "зарядка", "марафон", "гибкость", "тренировка", "турник",
        "лыжи", "хоккей", "футбол", "плав", "тонус", "активный",
        "сила", "выносливость", "скорость", "турнир", "движение",
        "двигать", "бег", "бежать", "летать", "кросс", "воркаут",
        "семья",
    )
    val WORDS_CHILDS = listOf(
        "детский", "дети", "детей", "детский садик", "анимация",
        "ребенок", "каникулы", "цирк", "детьми", "лагерь", "школьный", "школа",
    )

    val WORDS_PROMOS = listOf(
        "акции", "скидки", "выгода", "экономия", "сэкономить", "горячие предложения"
    )

    val WORDS_HOLIDAYS = listOf(
        "праздник", "салют","торжество", "отпраздновать", "день рождения","отметить",
        "юбилей","семья", "веселье", "веселиться","весело"
    )

    val WORDS_REGION = listOf(
        "поблизости","недалеко","близко",
        "рядом", "город","двор"
    )

    val WORDS_EMPTY_FRIENDS = listOf(
        "друзья", "веселье", "бар",
        "покурить кальян",
        "развлечься", "потанцевать", "танцы"
    )

    val WORDS_EMPTY_EAT = listOf(
        "пообедать", "поужинать", "ресторан", "кафе",
        "кофе", "обед", "еда", "сытно", "вкусно", "кухня",
        "голод", "завтрак", "бизнес ланч", "пицца", "бургеры",
        "макдональдс", "вкус", "подкрепиться", "вино", "десерт",
        "стейк", "пицца", "сладкий", "сладость", "", "аромат", "кухня", "блюдо", "мороженое",
        "веранда", "кофейня", "фастфуд", "ужин", "суп", "шашлык"
    )
    val WORDS_EMPTY_LOVE = listOf(
        "вторая половинка", "роментично", "романтичный", "ужин для двоих",
        "любовь", "свидание", "знакомства", "сюрприз для любимой", "для двоих"
        , "познакомиться"
    )

}